Revit 2024 API
CADExportOptions Class
Generic CAD Export options.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public abstract class CADExportOptions
Visual Basic
Public MustInherit Class CADExportOptions
Visual C++
public ref class CADExportOptions abstract
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.CADExportOptions
 Autodesk.Revit.DB.DWFExportOptions
See Also
CADExportOptions Members
Autodesk.Revit.DB Namespace